const ap_self = new APlayer({
    container: document.getElementById('m_self'),
    mini: false,
    autoplay: false,
    theme: '#FADFA3',
    loop: 'all',
    order: 'random',
    preload: 'auto',
    volume: 0.7,
    mutex: true,
    listFolded: false,
    listMaxHeight: 90,
    lrcType: 1,
    audio: [
        {
            name: '错位时空',
            artist: '艾辰',
            url: 'https://www.ytmp3.cn/down/74706.mp3',
            cover: 'https://img0.baidu.com/it/u=53043569,1589246528&fm=253&fmt=auto&app=120&f=JPEG?w=800&h=800',
            lrc: '[00:00.00]艾辰 - 错位时空\n[00:00.96]作词：周仁\n[00:01.65]作曲：张博文\n[00:02.48]编曲：陈林\n[00:03.17]分轨混音：Mr.鱼\n[00:04.14]制作人：艾辰\n[00:04.96]贝斯：谭玮\n[00:05.73]吉他：望雷\n[00:06.50]监制、统筹：孙斌@子文沐凡\n[00:08.51]贴唱、和声：沙栩帆\n[00:09.79]OP：腾煌星象\n[00:10.65]企划：丁柏昕、袁晓童\n[00:12.08]宣发：徐思灵\n[00:12.94]出品人：谢奇笛、凌联兴\n[00:13.96]出品：网易飓风工作室\n[00:15.22]填不满半排观众的电影\n[00:19.07]直到散场时突然亮起灯\n[00:22.64]字幕定格在某某出品和发行\n[00:26.17]我目送他们行色匆匆\n[00:29.74]像个自不量力的复读生\n[00:33.28]完不成金榜题名的使命\n[00:37.17]命不是猜剪刀石头布的决定\n[00:40.99]那么任性\n[00:44.52]我吹过你吹过的晚风\n[00:48.15]那我们算不算 相拥\n[00:51.60]可如梦初醒般的两手空空\n[00:55.30]心也空\n[00:58.85]我吹过你吹过的晚风\n[01:02.47]是否看过同样 风景\n[01:05.91]像扰乱时差留在错位时空\n[01:09.65]终是空 是空\n[01:30.74]数不完见证许愿的繁星\n[01:34.16]没灵验谁来安慰坏心情\n[01:37.92]十字路口闪烁不停的信号灯\n[01:41.34]有个人显然心事重重\n[01:45.01]三个字只能说给自己听\n[01:48.54]仰着头不要让眼泪失控\n[01:52.25]哪里有可以峰回路转的宿命\n[01:56.06]我不想听\n[01:59.68]我吹过你吹过的晚风\n[02:03.34]那我们算不算 相拥\n[02:06.83]可如梦初醒般的两手空空\n[02:10.55]心也空\n[02:13.89]我吹过你吹过的晚风\n[02:17.67]是否看过同样 风景\n[02:21.15]像扰乱时差留在错位时空\n[02:24.87]终是空 是空\n[02:32.05]我吹过你吹过的晚风\n[02:35.55]空气里弥漫着 心痛\n[02:39.04]可我们最后在这错位时空\n[02:42.68]终成空\n[02:46.28]我吹过你吹过的晚风\n[02:49.93]空气里弥漫着 心痛\n[02:53.33]可我们最后在这错位时空\n[02:57.04]终成空 成空'
        },
        {
            name: '错位时空',
            artist: '韩可可',
            url: 'https://iayay.com/yun/music/gfktxds/%E9%94%99%E4%BD%8D%E6%97%B6%E7%A9%BA-%E9%9F%A9%E5%8F%AF%E5%8F%AF.mp3',
            cover: 'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fi1.hdslb.com%2Fbfs%2Farchive%2F19844ff6f7eeac4c384f4146caa93719c6d284c3.png&refer=http%3A%2F%2Fi1.hdslb.com&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1653907338&t=37f3bc595a835692510260875aad1924',
            lrc:'[00:00.55]韩可可 - 错位时空(女版)\n[00:02.22]作词：夜半空寂凉\n[00:03.34]作曲：夜半空寂凉\n[00:17.48]我吹过你吹过的晚风\n[00:21.38]感受你曾感受的心痛\n[00:25.35]孤独的夜望着天空\n[00:29.35]眼泪都失控\n[00:33.41]你存在我存在的时空\n[00:37.31]还来不及对你说保重\n[00:41.37]越是怀念越是心痛\n[00:45.27]你是否也懂\n[00:49.32]回忆总是不分轻重\n[00:53.33]我也想过有始有终\n[00:57.32]曾经你也为我感动\n[01:01.23]为我而心动\n[01:05.43]我也试着慢慢接受\n[01:09.24]试着习惯没你以后\n[01:13.29]只是偶尔望着星空\n[01:17.30]迷失在梦中\n[01:37.47]回忆总是不分轻重\n[01:41.32]我也想过有始有终\n[01:45.33]曾经你也为我感动\n[01:49.28]为我而心动\n[01:53.38]我也试着慢慢接受\n[01:57.28]试着习惯没你以后\n[02:01.34]只是偶尔望着星空\n[02:05.33]迷失在梦中\n[02:11.61]我吹过你吹过的晚风\n[02:15.46]感受你曾感受的心痛\n[02:19.35]孤独的夜望着天空\n[02:23.41]眼泪都失控\n[02:27.46]你存在我存在的时空\n[02:31.36]还来不及对你说保重\n[02:35.43]越是怀念越是心痛\n[02:39.39]你是否也懂'
        },
        {
            name: '像我这样的人',
            artist: '毛不易',
            url: 'https://iayay.com/yun/music/gfktxds/%E5%83%8F%E6%88%91%E8%BF%99%E6%A0%B7%E7%9A%84%E4%BA%BA---%E6%AF%9B%E4%B8%8D%E6%98%93.mp3',
            cover: 'https://img1.baidu.com/it/u=4114335626,247267422&fm=253&fmt=auto&app=138&f=JPEG?w=800&h=500',
            lrc:'[00:00.17]毛不易 - 像我这样的人 (Live)\n[00:00.98]作词：毛不易\n[00:01.18]作曲：毛不易\n[00:01.39]编曲：郑楠\n[00:01.54]音乐总监：谭伊哲\n[00:01.79]乐队：TYZ乐队\n[00:02.05]乐队队长：黄竣琮\n[00:02.30]键盘：韩韵、杨猛\n[00:02.55]鼓手：胡宇飞\n[00:02.76]吉他：黄竣琮、Andrew Moore (加拿大)\n[00:03.26]贝斯：Ryan Bradetich (美国)\n[00:03.57]和声：宋豪、简绮琴、刘芮嘉\n[00:03.98]打击乐：Gman\n[00:04.18]电脑工程：郭丁尘\n[00:04.99]音乐统筹：吕易秋\n[00:16.31]像我这样优秀的人\n[00:19.97]本该灿烂过一生\n[00:23.88]怎么二十多年到头来\n[00:27.74]还在人海里浮沉\n[00:31.65]像我这样聪明的人\n[00:35.45]早就告别了单纯\n[00:39.36]怎么还是用了一段情\n[00:43.22]去换一身伤痕\n[00:47.28]像我这样迷茫的人\n[00:50.88]像我这样寻找的人\n[00:54.79]像我这样碌碌无为的人\n[00:58.81]你还见过多少人\n[01:21.90]像我这样庸俗的人\n[01:25.71]从不喜欢装深沉\n[01:29.62]怎么偶尔听到老歌时\n[01:33.38]忽然也晃了神\n[01:37.34]像我这样懦弱的人\n[01:41.25]凡事都要留几分\n[01:45.11]怎么曾经也会为了谁\n[01:48.81]想过奋不顾身\n[01:52.88]像我这样迷茫的人\n[01:56.79]像我这样寻找的人\n[02:00.60]像我这样碌碌无为的人\n[02:04.41]你还见过多少人\n[02:08.47]像我这样孤单的人\n[02:12.23]像我这样傻的人\n[02:16.04]像我这样不甘平凡的人\n[02:20.00]世界上有多少人\n[02:25.99]像我这样莫名其妙的人\n[02:30.26]会不会有人心疼'
        },
        {
            name: '我们不一样',
            artist: '大壮',
            url: 'https://iayay.com/yun/music/gfktxds/%E6%88%91%E4%BB%AC%E4%B8%8D%E4%B8%80%E6%A0%B7-%E5%A4%A7%E5%A3%AE.mp3',
            cover: 'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fmmbiz.qpic.cn%2Fmmbiz_jpg%2FYJ5icSx2QrVB9KqHoQWnAMoKETIDfwwdsTfBpaBpCl7KUibYDEmXIASmDTrt5zwiaicJYicLQZLibicCu2zlGBB3PjwRA%2F0%3Fwx_fmt%3Djpeg&refer=http%3A%2F%2Fmmbiz.qpic.cn&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1653914827&t=21679be2ccb686c43cd5600a26482cf2',
            lrc:'[00:00.00]大壮 - 我们不一样\n[00:00.94]词：高进\n[00:01.08]曲：高进\n[00:01.23]编曲：张亮\n[00:01.41]缩混：侯春阳\n[00:34.90]这么多年的兄弟\n[00:37.47]有谁比我更了解你\n[00:41.64]太多太多不容易\n[00:43.91]磨平了岁月和脾气\n[00:48.51]时间转眼就过去\n[00:50.92]这身后不散的筵席\n[00:54.69]只因为我们还在\n[00:57.33]心留在原地\n[01:01.34]张开手 需要多大的勇气\n[01:08.30]这片天 你我一起撑起\n[01:15.17]更努力 只为了我们想要的明天\n[01:21.90]好好的 这份情好好珍惜\n[01:28.74]我们不一样\n[01:31.77]每个人都有不同的境遇\n[01:35.83]我们在这里\n[01:37.98]在这里等你\n[01:42.43]我们不一样\n[01:45.35]虽然会经历不同的事情\n[01:49.29]我们都希望\n[01:51.60]来生还能相遇\n[01:57.30]这么多年的兄弟\n[01:59.75]有谁比我更了解你\n[02:03.99]太多太多不容易\n[02:06.35]磨平了岁月和脾气\n[02:10.77]时间转眼就过去\n[02:13.28]这身后不散的筵席\n[02:16.72]只因为我们还在\n[02:19.64]心留在原地\n[02:23.82]张开手 需要多大的勇气\n[02:30.61]这片天 你我一起撑起\n[02:37.46]更努力 只为了我们想要的明天\n[02:44.12]好好的 这份情好好珍惜\n[02:51.08]我们不一样\n[02:54.05]每个人都有不同的境遇\n[02:57.83]我们在这里\n[03:00.22]在这里等你\n[03:04.73]我们不一样\n[03:07.63]虽然会经历不同的事情\n[03:11.57]我们都希望\n[03:13.85]来生还能相遇\n[03:34.22]我们不一样\n[03:36.90]每个人都有不同的境遇\n[03:40.64]我们在这里\n[03:43.05]在这里等你\n[03:47.45]我们不一样\n[03:50.49]虽然会经历不同的事情\n[03:54.37]我们都希望\n[03:56.74]来生还能相遇\n[04:01.33]我们不一样\n[04:04.21]虽然会经历不同的事情\n[04:08.15]我们都希望\n[04:10.44]来生还能相遇\n[04:15.04]我们都希望\n[04:17.21]来生还能相遇'
        },
        {
            name: '纸短情长',
            artist: '花粥',
            url: 'https://iayay.com/yun/music/gfktxds/%E7%BA%B8%E7%9F%AD%E6%83%85%E9%95%BF---%E8%8A%B1%E7%B2%A5.mp3',
            cover: 'https://img2.baidu.com/it/u=964760556,967820495&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500',
            lrc:'[00:11.26]你陪我步入蝉夏\n[00:13.88]越过城市喧嚣\n[00:16.56]歌声还在游走\n[00:19.52]你榴花般的双眸\n[00:22.29]不见你的温柔\n[00:24.94]丢失花间欢笑\n[00:27.82]岁月无法停留\n[00:31.23]流云的等候\n[00:34.32]我真的好想你\n[00:36.53]在每一个雨季\n[00:38.74]你选择遗忘的\n[00:41.14]是我最不舍的\n[00:43.65]纸短情长啊\n[00:46.13]道不尽太多涟漪\n[00:49.20]我的故事都是关于你呀\n[00:53.55]怎么会爱上了他\n[00:55.48]并决定跟他回家\n[00:58.30]放弃了我的所有\n[01:00.69]我的一切无所谓\n[01:03.47]纸短情长啊\n[01:04.87]诉不完当时年少\n[01:08.73]我的故事还是关于你呀\n[01:33.16]你陪我步入蝉夏\n[01:35.53]越过城市喧嚣\n[01:38.01]歌声还在游走\n[01:40.17]你榴花般的双眸\n[01:42.62]不见你的温柔\n[01:44.86]丢失花间欢笑\n[01:47.12]岁月无法停留\n[01:50.11]流云的等候\n[01:52.18]我真的好想你\n[01:54.88]在每一个雨季\n[01:57.41]你选择遗忘的\n[01:59.72]是我最不舍的\n[02:01.92]纸短情长啊\n[02:04.25]道不尽太多涟漪\n[02:07.41]我的故事都是关于你呀\n[02:11.83]怎么会爱上了他\n[02:13.87]并决定跟他回家\n[02:16.15]放弃了我的所有\n[02:18.29]我的一切无所谓\n[02:20.93]纸短情长啊\n[02:23.32]诉不完当时年少\n[02:26.28]我的故事还是关于你呀\n[02:41.53]你陪我步入蝉夏\n[02:44.18]越过城市喧嚣\n[02:46.83]歌声还在游走\n[02:49.61]你榴花般的双眸\n[02:52.05]不见你的温柔\n[02:54.78]丢失花间欢笑\n[02:57.75]岁月无法停留\n[03:00.91]流云的等候'
        },
        {
            name: '奔赴星空',
            artist: '尹昔眠&小田音乐社',
            url: 'https://iayay.com/yun/music/gfktxds/%E5%A5%94%E8%B5%B4%E6%98%9F%E7%A9%BA---%E5%B0%B9%E6%98%94%E7%9C%A0-%E5%B0%8F%E7%94%B0%E9%9F%B3%E4%B9%90%E7%A4%BE.mp3',
            cover: 'https://y.qq.com/music/photo_new/T002R300x300M000004Sp3JN1K1mGT_2.jpg?max_age=2592000',
            lrc:'[00:00.25]尹昔眠、小田音乐社 - 奔赴星空\n[00:01.11]作词：景尧\n[00:01.27]作曲：贰叁伍\n[00:01.42]编曲：马小天\n[00:01.62]录音：小田音乐社\n[00:01.82]混音：严皓俊\n[00:02.03]制作人：侯小鑫_Ashton\n[00:02.23]出品：耳蜗音乐_Cochlea Music\n[00:02.48]营销推广：华声时代\n[00:02.79]「未经授权,不得翻唱或使用」\n[00:17.13]若我可以化作一颗星\n[00:18.85]陪你闪耀\n[00:20.52]让月色温柔这季节的面貌\n[00:24.28]追着时光奔跑\n[00:25.54]等流星划过就祈祷\n[00:28.12]在某一刻我开始变得重要\n[00:31.56]把你的烦恼\n[00:32.68]全抛到银河里丢掉\n[00:35.26]然后微风不燥一切都刚好\n[00:38.95]如梦般的自由\n[00:40.27]再画出浪漫的符号\n[00:42.86]让这段远距离能慢慢颠倒\n[00:46.35]你落在了星空而我在人海中\n[00:50.00]抬头看到的你\n[00:51.37]就是我眼里的苍穹\n[00:53.90]想念是不停歇的风\n[00:55.98]就任它放纵\n[00:57.60]带我所想的飞去有你的星空\n[01:01.14]你落在了星空而我忧心忡忡\n[01:04.79]怕犹豫中无处安放的情绪你不懂\n[01:08.73]不是三秒钟的心动\n[01:10.76]会消失无踪\n[01:12.38]想和你度过所有的春夏秋冬\n[01:30.95]若我可以化作一颗星\n[01:32.67]陪你闪耀\n[01:34.34]让月色温柔这季节的面貌\n[01:38.03]追着时光奔跑\n[01:39.34]等流星划过就祈祷\n[01:41.92]在某一刻我开始变得重要\n[01:45.41]把你的烦恼\n[01:46.52]全抛到银河里丢掉\n[01:49.11]然后微风不燥一切都刚好\n[01:52.80]如梦般的自由\n[01:54.12]再画出浪漫的符号\n[01:56.70]让这段远距离能慢慢颠倒\n[02:00.14]你落在了星空而我在人海中\n[02:03.83]抬头看到的你\n[02:05.19]就是我眼里的苍穹\n[02:07.72]想念是不停歇的风\n[02:09.80]就任它放纵\n[02:11.47]带我所想的飞去有你的星空\n[02:14.95]你落在了星空而我忧心忡忡\n[02:18.60]怕犹豫中无处安放的情绪你不懂\n[02:22.54]不是三秒钟的心动\n[02:24.57]会消失无踪\n[02:26.23]想和你度过所有的春夏秋冬\n[02:33.43]你落在了星空而我在人海中\n[02:37.07]抬头看到的你\n[02:38.44]就是我眼里的苍穹\n[02:40.97]想念是不停歇的风\n[02:43.05]就任它放纵\n[02:44.72]带我所想的飞去有你的星空\n[02:48.16]你落在了星空而我忧心忡忡\n[02:51.80]怕犹豫中无处安放的情绪你不懂\n[02:55.71]不是三秒钟的心动\n[02:57.78]会消失无踪\n[02:59.51]想和你度过所有的春夏秋冬'
        },
        {
            name: '我的天空',
            artist: '南征北战NZBZ',
            url: 'https://www.ytmp3.cn/down/77028.mp3',
            cover: 'https://img1.baidu.com/it/u=1973539770,3586965967&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500',
            lrc:'[00:00.51]南征北战NZBZ - 我的天空\n[00:01.32]作词：醉人赵辰龙\n[00:01.52]作曲：汀洋\n[00:02.33]企划：王烨扬\n[00:03.29]发行人：桑爱\n[00:21.66]再见我的爱\n[00:22.72]I Wanna Say Goodbye\n[00:24.20]再见我的过去\n[00:25.62]I Want a New Life\n[00:26.93]再见我的眼泪跌倒和失败\n[00:29.72]再见那个年少轻狂的时代\n[00:32.60]再见我的烦恼不再孤单\n[00:35.18]再见我的懦弱不再哭喊\n[00:37.79]Now I wanna say hello hello\n[00:40.46]我的未来hello hello\n[00:43.73]在无尽的黑夜\n[00:46.21]所有都快要毁灭\n[00:48.98]至少我还有梦\n[00:51.41]也为你而感动\n[00:54.21]原来黎明的起点\n[00:57.14]就在我的心里面\n[00:59.88]只要我还有梦\n[01:02.35]就会看到彩虹\n[01:05.62]在我的天空\n[01:10.58]Yeah\n[01:12.32]挫折和离别不过是\n[01:13.45]生命中的点缀\n[01:14.81]过了多年我才读懂了\n[01:16.23]家人的眼泪\n[01:17.66]发现原来自己没有说\n[01:19.34]再见的勇气\n[01:20.35]离别的伤感感染了\n[01:21.81]满城的空气\n[01:22.93]失去后才知道那些\n[01:24.30]有多么的珍贵\n[01:25.76]亲爱的朋友们是否\n[01:27.13]已经展翅纷飞\n[01:28.45]不飞到高处怎么开阔\n[01:29.96]自己的视野\n[01:31.23]你已经长大了\n[01:32.60]快告诉全世界\n[01:33.96]外面的世界散发着\n[01:35.59]强大的磁场\n[01:36.70]诱惑着每一双即将\n[01:38.37]展开的翅膀\n[01:39.48]热恋的火在懵懂中\n[01:41.10]凶猛地燃烧\n[01:42.21]美丽的火花在恋人的\n[01:44.03]周围环绕\n[01:45.27]这过程很美\n[01:46.23]尽管有无奈和失落\n[01:47.75]刻骨铭心地爱过\n[01:48.91]尽管她爱的并不是我\n[01:51.06]如果没有离别如何\n[01:52.32]学会承受打击\n[01:53.49]如果没有跌倒如何\n[01:54.80]能够学会爬起\n[01:56.07]在无尽的黑夜\n[01:57.94]所有都快要毁灭\n[02:00.52]至少我还有梦\n[02:03.10]也为你而感动\n[02:05.93]原来黎明的起点\n[02:08.92]就在我的心里面\n[02:11.54]只要我还有梦\n[02:14.12]就会看到彩虹\n[02:17.13]在我的天空\n[02:29.59]hello hello是谁在为我等待\n[02:32.48]hello hello在那神秘的未来\n[02:35.03]hello hello找到属于我的爱\n[02:37.71]hello hello This is my new life\n[02:41.67]是谁在为我等待\n[02:44.19]在那神秘的未来\n[02:46.97]找到属于我的爱\n[02:50.66]在无尽的黑夜\n[02:52.99]所有都快要毁灭\n[02:55.72]至少我还有梦\n[02:58.20]也为你而感动\n[03:01.14]原来黎明的起点\n[03:04.12]就在我的心里面\n[03:06.82]只要我还有梦\n[03:09.14]就会看到彩虹\n[03:12.55]在无尽的黑夜\n[03:15.14]所有都快要毁灭\n[03:17.94]至少我还有梦\n[03:20.31]也为你而感动\n[03:23.20]原来黎明的起点\n[03:26.18]就在我的心里面\n[03:28.91]只要我还有梦\n[03:31.44]就会看到彩虹\n[03:34.43]在我的天空'
        }
        
    ]
    
});

const ap_pure = new APlayer({
    container: document.getElementById('m_pure'),
    mini: false,
    autoplay: false,
    theme: '#FADFA3',
    loop: 'all',
    order: 'random',
    preload: 'auto',
    volume: 0.7,
    mutex: true,
    listFolded: false,
    listMaxHeight: 90,
    lrcType: 1,
    audio: [
        {    
            name: '城南花已开',
            artist: '三亩地',
            url: 'https://www.ytmp3.cn/down/47675.mp3',
            cover: 'https://img2.baidu.com/it/u=598781917,2411767849&fm=253&fmt=auto&app=138&f=JPEG?w=789&h=500',
            lrc:'[00:00.51]城南花已开\n[00:03.00]愿君永长在\n[00:07.00]虽未曾逢君\n[00:10.00]却与君相惜\n[00:14.00]望岁岁今朝\n[00:17.00]愿年年花开\n[00:20.00]介时花未尽\n[00:25.00]与君望城南\n[00:30.00]待君归来时\n[00:34.00]花开城南外'
        },
        {
            name: '所念皆星河',
            artist: 'CMJ',
            url: 'https://www.ytmp3.cn/down/74714.mp3',
            cover: 'https://img0.baidu.com/it/u=2215456526,759918534&fm=253&fmt=auto&app=120&f=JPEG?w=300&h=200',
            lrc:'[00:00.00]星河皆是你'
        },
        {
            name: 'Asphyxia',
            artist: '逆时针向',
            url: 'https://www.ytmp3.cn/down/77029.mp3',
            cover: 'https://gimg2.baidu.com/image_search/src=http%3A%2F%2Fi2.hdslb.com%2Fbfs%2Farchive%2F7133537a7daebca5616ebbb7fbb94365112f0ba3.png&refer=http%3A%2F%2Fi2.hdslb.com&app=2002&size=f9999,10000&q=a80&n=0&g=0n&fmt=auto?sec=1654070732&t=2332d9b314e89a9ac4a16c21ebc395bf',
            lrc:'[00:00.00]Asphyxia-逆时针向'
        }
    ]
    
});



/*双轮换
function mus_change(){
    if(document.getElementById('music_self').style.display=="none"){
        document.getElementById('music_li').style.display="none"
        document.getElementById('music_self').style.display="block"
        document.getElementById('mus_heart').style.display="none"
        document.getElementById('mus_heartbeat').style.display="inline"
    }else{
        document.getElementById('music_li').style.display="block"
        document.getElementById('music_self').style.display="none"
        document.getElementById('mus_heartbeat').style.display="none"
        document.getElementById('mus_heart').style.display="inline"
    }
}
*/

// 叁轮换
function mus_change(){
    if(document.getElementById('music_li').style.display=="none"){
        if(document.getElementById('music_pure').style.display=="none"){
           document.getElementById('music_self').style.display="none";
           document.getElementById('music_pure').style.display="block";

           document.getElementById('mus_self').style.display="none";
           document.getElementById('mus_pure').style.display="inline";
        }else{
           document.getElementById('music_li').style.display="block";
           document.getElementById('music_pure').style.display="none";

           document.getElementById('mus_li').style.display="inline";
           document.getElementById('mus_pure').style.display="none";
        }
    }else{
        document.getElementById('music_li').style.display="none";
        document.getElementById('music_self').style.display="block";

        document.getElementById('mus_li').style.display="none";
        document.getElementById('mus_self').style.display="inline";
    }
}
